from aerial_gym.config.sensor_config.base_sensor_config import BaseSensorConfig


class BaseImuConfig(BaseSensorConfig):
    num_sensors = 1  # 传感器数量，此类型的传感器数量为1。多个相同链接上的传感器没有意义，除非需要在不同链接上实现多个传感器。

    sensor_type = "imu"  # 传感器类型，这里是惯性测量单元（IMU）

    world_frame = False  # 是否使用世界坐标系

    # 启用或禁用噪声和偏差。设置为False将模拟一个完美、无噪声和无偏差的IMU
    enable_noise = True  
    enable_bias = True  

    # 从样本VN100 IMU获得的偏差和噪声值
    bias_std = [
        9.782812831313576e-07,  # 加速度计偏差标准差X轴
        9.782812831313576e-07,  # 加速度计偏差标准差Y轴
        9.782812831313576e-07,  # 加速度计偏差标准差Z轴
        2.6541629581345176e-05,  # 陀螺仪偏差标准差X轴
        2.6541629581345176e-05,  # 陀螺仪偏差标准差Y轴
        2.6541629581345176e-05,  # 陀螺仪偏差标准差Z轴
    ]  
    
    imu_noise_std = [
        0.001688956233495657,  # 加速度计噪声标准差X轴
        0.001688956233495657,  # 加速度计噪声标准差Y轴
        0.001688956233495657,  # 加速度计噪声标准差Z轴
        0.0010679343003532472,  # 陀螺仪噪声标准差X轴
        0.0010679343003532472,  # 陀螺仪噪声标准差Y轴
        0.0010679343003532472,  # 陀螺仪噪声标准差Z轴
    ]  
    
    max_measurement_value = [
        100.0,  # 加速度输出最大值限制X轴
        100.0,  # 加速度输出最大值限制Y轴
        100.0,  # 加速度输出最大值限制Z轴
        10.0,   # 陀螺仪输出最大值限制X轴
        10.0,   # 陀螺仪输出最大值限制Y轴
        10.0,   # 陀螺仪输出最大值限制Z轴
    ]  
    
    max_bias_init_value = [
        1.0e-03,  # 加速度计初始偏差最大值范围X轴
        1.0e-03,  # 加速度计初始偏差最大值范围Y轴
        1.0e-03,  # 加速度计初始偏差最大值范围Z轴
        1.0e-03,  # 陀螺仪初始偏差最大值范围X轴
        1.0e-03,  # 陀螺仪初始偏差最大值范围Y轴
        1.0e-03,  # 陀螺仪初始偏差最大值范围Z轴
    ]  
    
    # 设置为True时，将提供相对于地面的静态框架中的物体加速度。
    gravity_compensation = False  # 通常力传感器计算包括重力的总力，因此设置为False

    # 此位置硬编码在资产中心。如果需要，可以通过代码更改此位置。

    # 随机化传感器相对于父链接的方向。位置仍然是在父链接框架中的[0,0,0]
    randomize_placement = False  
    min_euler_rotation_deg = [-2.0, -2.0, -2.0]  # 最小欧拉角旋转度数
    max_euler_rotation_deg = [2.0, 2.0, 2.0]      # 最大欧拉角旋转度数
