from aerial_gym.config.sensor_config.imu_config.base_imu_config import BaseImuConfig

# BoschBMI088Config类继承自BaseImuConfig，用于配置Bosch BMI088 IMU传感器的参数
class BoschBMI088Config(BaseImuConfig):
    num_sensors = 1  # 该类型传感器的数量。一个链接上不需要多个相同类型的传感器。如果需要，可以为不同的链接实现多个传感器。

    sensor_type = "imu"  # 传感器类型

    world_frame = False  # 是否使用世界坐标系

    # 启用或禁用噪声和偏差。设置为False将模拟一个完美、无噪声和无偏差的IMU
    enable_noise = True  
    enable_bias = True  

    # 从样本VN100 IMU获得的偏差和噪声值
    bias_std = [
        0.0013564659966250536,  # 加速度计偏差标准差（x轴）
        0.0013564659966250536,  # 加速度计偏差标准差（y轴）
        0.0013564659966250536,  # 加速度计偏差标准差（z轴）
        1.4352700094407325e-05,  # 陀螺仪偏差标准差（x轴）
        1.4352700094407325e-05,  # 陀螺仪偏差标准差（y轴）
        1.4352700094407325e-05,  # 陀螺仪偏差标准差（z轴）
    ]  
    
    imu_noise_std = [
        0.0015690639999999998,  # 加速度计噪声标准差（x轴）
        0.0015690639999999998,  # 加速度计噪声标准差（y轴）
        0.0018632634999999997,  # 加速度计噪声标准差（z轴）
        0.0002443460952792061,  # 陀螺仪噪声标准差（x轴）
        0.0002443460952792061,  # 陀螺仪噪声标准差（y轴）
        0.0002443460952792061,  # 陀螺仪噪声标准差（z轴）
    ]  
    
    max_measurement_value = [
        100.0,  # 加速度计最大测量值（x轴）
        100.0,  # 加速度计最大测量值（y轴）
        100.0,  # 加速度计最大测量值（z轴）
        10.0,   # 陀螺仪最大测量值（x轴）
        10.0,   # 陀螺仪最大测量值（y轴）
        10.0,   # 陀螺仪最大测量值（z轴）
    ]  # 加速度计和陀螺仪输出的最大测量值会被限制在正负这些值之内

    max_bias_init_value = [
        1.0e-03,  # 加速度计偏差初始化最大值（x轴）
        1.0e-03,  # 加速度计偏差初始化最大值（y轴）
        1.0e-03,  # 加速度计偏差初始化最大值（z轴）
        1.0e-03,  # 陀螺仪偏差初始化最大值（x轴）
        1.0e-03,  # 陀螺仪偏差初始化最大值（y轴）
        1.0e-03,  # 陀螺仪偏差初始化最大值（z轴）
    ]  # 加速度计和陀螺仪偏差将在正负这个范围内进行采样

    # 将此设置为True将提供相对于地面的静态框架中的物体加速度。
    gravity_compensation = False  # 通常力传感器计算包括重力的总力，因此将其设置为False

    # 此位置硬编码在资产的中心。如果需要，用户可以在代码中更改它。

    # 随机化传感器相对于父链接的方向。位置仍然是[0,0,0]在父链接框架中
    randomize_placement = True  
    min_euler_rotation_deg = [-2.0, -2.0, -2.0]  # 最小欧拉角旋转（度）
    max_euler_rotation_deg = [2.0, 2.0, 2.0]      # 最大欧拉角旋转（度）
